// Copyright 2022 Arthur Sonzogni (@ArthurSonzogni)
// SPDX-License-Identifier: GPL-2.0

#include QMK_KEYBOARD_H

// This is meant to be used with an AZERTY OS layout.
const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {
  // ┌───┬─────┬─────┬─────┬─────┬─────┐  ┌─────┬─────┬─────┬─────┬─────┬──────┐
  // │TAB│ A ä │ Z Å │ E ¢ │ R ¢ │ T Þ │  │ Y Ý │ U ü │ I ï │ O ö │ P ` │ BSPC │
  // │TAB│ a â │ z å │ e € │ r ç │ t þ │  │ y ý │ u û │ i î │ o ô │ p ¶ │ BSPC │
  // ├───┼─────┼─────┼─────┼─────┼─────┤  ├─────┼─────┼─────┼─────┼─────┼──────┤
  // │SFT│ Q Ä │ S Ø │ D Ë │ F ª │ G Æ │  │ H Ð │ J Ü │ K Ï │ L Ö │ M º │      │
  // │SFT│ q Â │ s ø │ d Ê │ f ± │ g æ │  │ h ð │ j Û │ k Î │ l Ô │ m ¹ │      │
  // ├───┼─────┼─────┼─────┼─────┼─────┤  ├─────┼─────┼─────┼─────┼─────┼──────┤
  // │CTL│ W < │ X > │ C © │ V ‘ │ B ẞ │  │ N N │ ? º │ . × │ / ÷ │ § ˙ │      │
  // │CTL│ w « │ x » │ c © │ v ® │ b ß │  │ n ¬ │ , ¿ │ ; × │ : ÷ │ ! ¡ │      │
  // └───┴─────┴─────┴─────┴─────┴─────┘  └─────┴─────┴─────┴─────┴─────┴──────┘
  //                ┌─────┬─────┬──────┐  ┌───┬──────┬──────┐
  //                │TAB  │ Q   │ BSPC │  │ENT│ SPC  │ Esc  │ (tap)
  //                │LALT │ WIN │ L1   │  │L2 │ LSFT │ RALT │ (hold)
  //                └─────┴─────┴──────┘  └───┴──────┴──────┘
  [0] = LAYOUT_split_3x6_3(
      KC_TAB  , KC_Q , KC_W , KC_E , KC_R , KC_T /**/ , /**/ KC_Y , KC_U , KC_I    , KC_O   , KC_P    , KC_BSPC ,
      KC_LSFT , KC_A , KC_S , KC_D , KC_F , KC_G /**/ , /**/ KC_H , KC_J , KC_K    , KC_L   , KC_SCLN , KC_QUOT ,
      KC_LCTL , KC_Z , KC_X , KC_C , KC_V , KC_B /**/ , /**/ KC_N , KC_M , KC_COMM , KC_DOT , KC_SLSH , KC_RSFT ,
      /*-------------------------------------------------------------------------------------------------------*/
      LALT_T(KC_TAB), LGUI_T(KC_SPC) , LT(1, KC_BSPC) /**/ , /**/ LT(2, KC_ENT) , LSFT_T(KC_SPC) , RALT_T(KC_ESC)
  ),                           
  
  // ┌───┬───┬───┬───┬───┬───┐  ┌───┬───┬───┬───┬───┬───┐
  // │   │   │   │ ↑ │   │   │  │   │ 7 │ 8 │ 9 │ / │ * │
  // ├───┼───┼───┼───┼───┼───┤  ├───┼───┼───┼───┼───┼───┤
  // │   │   │ ← │ ↓ │ → │   │  │   │ 4 │ 5 │ 6 │ + │ - │
  // ├───┼───┼───┼───┼───┼───┤  ├───┼───┼───┼───┼───┼───┤
  // │   │   │   │   │   │   │  │   │ 1 │ 2 │ 3 │ . │ = │
  // └───┴───┴───┴───┴───┴───┘  └───┴───┴───┴───┴───┴───┘
  //      ┌─────┬─────┬──────┐  ┌───┬─────┬───┐
  //      │     │     │ [L1] │  │   │LSFT │ 0 │
  //      └─────┴─────┴──────┘  └───┴─────┴───┘
  [1] = LAYOUT_split_3x6_3(
      KC_NO , KC_NO , KC_NO   , KC_UP   , KC_NO    , KC_NO/**/ , /**/ KC_NO , KC_P7 , KC_P8 , KC_P9 , KC_PSLS , KC_PAST ,
      KC_NO , KC_NO , KC_LEFT , KC_DOWN , KC_RIGHT , KC_NO/**/ , /**/ KC_NO , KC_P4 , KC_P5 , KC_P6 , KC_PPLS , KC_PMNS ,
      KC_NO , KC_NO , KC_NO   , KC_NO   , KC_NO    , KC_NO/**/ , /**/ KC_NO , KC_P1 , KC_P2 , KC_P3 , KC_PDOT , KC_PEQL ,
      /*-------------------------------------------------------------------------------------------------------*/
      KC_NO , KC_NO , KC_NO/**/ , /**/ KC_NO , KC_LSFT , KC_P0
  ),

  // ┌───┬───┬───┬───┬───┬───┐  ┌───┬───┬───┬───┬───┬───┐
  // │   │   │ & │ é │ " │ ` │  │ \ │ { │ } │ @ │   │   │
  // ├───┼───┼───┼───┼───┼───┤  ├───┼───┼───┼───┼───┼───┤
  // │   │   │ ' │ ( │ - │ ~ │  │ < │ ( │ ) │ > │   │   │
  // ├───┼───┼───┼───┼───┼───┤  ├───┼───┼───┼───┼───┼───┤
  // │   │   │ è │ _ │ ç │   │  │   │ [ │ ] │   │   │   │
  // └───┴───┴───┴───┴───┴───┘  └───┴───┴───┴───┴───┴───┘
  //      ┌─────┬─────┬──────┐  ┌─────┬────────┬──────┐
  //      │LALT │ WIN │      │  │[L2] │ LSHIFT │      │ 
  //      └─────┴─────┴──────┘  └─────┴────────┴──────┘
  [2] = LAYOUT_split_3x6_3(
      KC_NO , KC_NO , KC_1 , KC_2 , KC_3 , RALT(KC_7)/**/ , /**/ RALT(KC_8) , RALT(KC_4) , RALT(KC_EQL)  , RALT(KC_0)    , KC_NO , KC_NO ,
      KC_NO , KC_NO , KC_4 , KC_5 , KC_6 , RALT(KC_2)/**/ , /**/ KC_NUBS    , KC_5       , KC_MINS       , LSFT(KC_NUBS) , KC_NO , KC_NO ,
      KC_NO , KC_NO , KC_7 , KC_8 , KC_9 , KC_NO/**/      , /**/ KC_NO      , RALT(KC_5) , RALT(KC_MINS) , KC_NO         , KC_NO , KC_NO ,
      /*-------------------------------------------------------------------------------------------------------*/
      KC_LALT, KC_LGUI, KC_NO/**/ , /**/ KC_NO , KC_LSFT, KC_NO
  ),
};
